# AreaCreationData Constructor (ViewPlan, UV) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaCreationData Constructor (ViewPlan, UV)
AreaCreationData Class See Also
---
The data needed to create a new area
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AreaCreationData(
	ViewPlan areaView,
	UV point
)
```

Visual Basic
---
```text
Public Sub New ( _
	areaView As ViewPlan, _
	point As UV _
)
```

Visual C++
---
```text
public:
AreaCreationData(
	ViewPlan^ areaView,
	UV^ point
)
```

# ### Parameters
areaView
    Type: Autodesk.Revit.DB..::..ViewPlanThe view of area element.
point
    Type: Autodesk.Revit.DB..::..UVThe point which lies in the enclosed region of AreaBoundaryLines to put the new created Area
# See Also
AreaCreationData Class
AreaCreationData Overload
Autodesk.Revit.Creation Namespace